app/controllers/books_controller.rb

	def index
		@books =  Book.paginate :page => params[:page], :per_page => 8
---
SELECT "books".* FROM "books" LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "books"

	def show
		@book = Book.find(params[:id])
		@comments = @book.comments.paginate :page => params[:page], :per_page => 5, :order => 'created_at ASC'
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "comments".* FROM "comments" WHERE "comments"."book_id" = 2 ORDER BY created_at ASC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "comments" WHERE "comments"."book_id" = 2

	def create
		book = Book.new(params[:book])  # form_for posts the entire model associated with it as the parameter in hash format. So we read that hash value (i.e :book) and create a book object out of it.
		if book.save
---
INSERT INTO "books" ("created_at", "thoughts", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 25 Sep 2012 11:42:54 UTC +00:00], ["thoughts", "This is what it has"], ["title", "Wings"], ["updated_at", Tue, 25 Sep 2012 11:42:54 UTC +00:00]]

	def update
		book = Book.find(params[:id])
		if book.update_attributes(params[:book])
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "books" SET "thoughts" = 'some sentences from a super long paragraph.. Great !!!', "updated_at" = '2012-10-01 15:15:14.022118' WHERE "books"."id" = 1