app/controllers/comments_controller.rb

	def create
		book = Book.find(params[:book_id])
		comment = book.comments.new(params[:comment])
		comment.save
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("author", "book_id", "created_at", "text", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "Adam"], ["book_id", 1], ["created_at", Tue, 25 Sep 2012 09:24:43 UTC +00:00], ["text", "Test"], ["updated_at", Tue, 25 Sep 2012 09:24:43 UTC +00:00]]